In [1]:
import pandas as pd 
import numpy as np

In [4]:
# Handling Date Values..........................................................
date = pd.read_csv('first_file.csv')
date.head()

   ID    Name  Amount        Date
0   1  User_1     1.5  2024-01-01
1   2  User_2     3.0  2024-01-02
2   3  User_3     4.5  2024-01-03
3   4  User_4     6.0  2024-01-04
4   5  User_5     7.5  2024-01-05

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      100 non-null    int64
 1   Name    100 non-null    object
 2   Amount  100 non-null    float64
 3   Date    100 non-null    object
dtypes: float64(1), int64(1), object(2)
memory usage: 3.3+ KB

In [6]:
date['Date'] = pd.to_datetime(date['Date'])

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      100 non-null    int64
 1   Name    100 non-null    object
 2   Amount  100 non-null    float64
 3   Date    100 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 3.3+ KB

In [9]:
date.head()

   ID    Name  Amount       Date
0   1  User_1     1.5 2024-01-01
1   2  User_2     3.0 2024-01-02
2   3  User_3     4.5 2024-01-03
3   4  User_4     6.0 2024-01-04
4   5  User_5     7.5 2024-01-05

In [13]:
date['date_year'] = date['Date'].dt.year

In [15]:
date['date_month'] = date['Date'].dt.month

In [17]:
date['date_monthName'] = date['Date'].dt.month_name()

In [19]:
date['date_day'] = date['Date'].dt.day

In [22]:
date['date_dayOfWeek'] = date['Date'].dt.dayofweek

In [24]:
date['date_week_name'] = date['Date'].dt.day_name()

In [26]:
date['date_is_weekend'] = np.where(date['date_week_name'].isin(['Sunday', 'Saturday']), 1, 0)

In [28]:
date['quater'] = date['Date'].dt.quarter

In [29]:
date.head()

,ID,Name,Amount,Date,date_year,date_month,date_monthName,date_day,date_dayOfWeek,date_week_name,date_is_weekend,quater
0,1,User_1,1.5,2024-01-01,2024,1,January,1,0,Monday,0,1
1,2,User_2,3.0,2024-01-02,2024,1,January,2,1,Tuesday,0,1
2,3,User_3,4.5,2024-01-03,2024,1,January,3,2,Wednesday,0,1
3,4,User_4,6.0,2024-01-04,2024,1,January,4,3,Thursday,0,1
4,5,User_5,7.5,2024-01-05,2024,1,January,5,4,Friday,0,1

In [33]:
# Handling Time Variables....................................
time = pd.read_csv('second_file.csv')
time.head()

   Entry_No             DateTime  Value
0         1  2024-01-01 00:00:00     10
1         2  2024-01-01 01:00:00     20
2         3  2024-01-01 02:00:00     30
3         4  2024-01-01 03:00:00     40
4         5  2024-01-01 04:00:00     50

In [34]:
time['DateTime'] = pd.to_datetime(time['DateTime'])

In [35]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Entry_No  100 non-null    int64
 1   DateTime  100 non-null    datetime64[ns]
 2   Value     100 non-null    int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 2.5 KB

In [39]:
time['hour'] = time['DateTime'].dt.hour
time['min'] = time['DateTime'].dt.minute
time['sec'] = time['DateTime'].dt.second
time['time'] = time['DateTime'].dt.time

In [40]:
time.head()

   Entry_No            DateTime  Value  hour  min  sec      time
0         1 2024-01-01 00:00:00     10     0    0    0  00:00:00
1         2 2024-01-01 01:00:00     20     1    0    0  01:00:00
2         3 2024-01-01 02:00:00     30     2    0    0  02:00:00
3         4 2024-01-01 03:00:00     40     3    0    0  03:00:00
4         5 2024-01-01 04:00:00     50     4    0    0  04:00:00